In [1]:
import pandas as pd
import requests as req
import json

# JSON

In [2]:

with open("D:\\Code\\Python\\Class\\My Class\\DataSet\\TestJSON\\jsonDataTest.json", "r") as f:
    data = json.load(f)

df_posts = pd.json_normalize(data['posts'])
print(df_posts)

   id   title
0   1  Post 1
1   2  Post 2
2   3  Post 3

# SQL

In [9]:
import mysql.connector as sql

In [28]:
conn = sql.connect(
    host="localhost",
    user="root",   
    password="D@ksh@SQL",
    database="world"
)

In [29]:

pd.read_sql_query("Show tables;", conn)

C:\Users\HP\AppData\Local\Temp\ipykernel_5116\1628173267.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("Show tables;", conn)

   Tables_in_world
0             city
1          country
2  countrylanguage

In [31]:
pd.read_sql_query("Select * from city;", conn)

C:\Users\HP\AppData\Local\Temp\ipykernel_5116\895999459.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("Select * from city;", conn)

        ID            Name CountryCode       District  Population
0        1           Kabul         AFG          Kabol     1780000
1        2        Qandahar         AFG       Qandahar      237500
2        3           Herat         AFG          Herat      186800
3        4  Mazar-e-Sharif         AFG          Balkh      127800
4        5       Amsterdam         NLD  Noord-Holland      731200
...    ...             ...         ...            ...         ...
4074  4075      Khan Yunis         PSE     Khan Yunis      123175
4075  4076          Hebron         PSE         Hebron      119401
4076  4077        Jabaliya         PSE     North Gaza      113901
4077  4078          Nablus         PSE         Nablus      100231
4078  4079           Rafah         PSE          Rafah       92020

[4079 rows x 5 columns]